gdgly/NUC97X_JS/STM32F4xx/DL698/RM_TASK_USERxxx.c
				//先找全匹配
		#if PARAMETER_601E==0//设置参数601E采集规则库使用:0=内部默认,1=可设置
					p32=(u32*)SETINIT_601E_List;
					n=Get_SETINIT_601E_List_NUM();//得到采集规则库初始设置库列表个数
					for(i=0;i<n;i++)
					{
						p8d=(u8*)p32[0];
						if(p8d[0]==DataType_structure)
						{
							for(x=0;x<LEN_CSD;x++)
							{
								if(UARTCtrl->RMCSD[x]!=p8d[2+x])
								{
									break;
								}
							}
							if(x>=LEN_CSD)
							{
								break;
							}
						}
						p32+=2;
					}
					if(i>=n)
					{
						i=NUMmax_601E;
					}
		#else
			#if LENmax_601E>LEN_128KDATABUFF
					#error
			#endif
					MR(ADDR_128KDATABUFF,ADDR_601E,LENmax_601E);
					p8d=(u8*)ADDR_128KDATABUFF;
					for(i=0;i<NUMmax_601E;i++)
					{
						if(p8d[0]==DataType_structure)
						{
							for(x=0;x<LEN_CSD;x++)
							{
								if(UARTCtrl->RMCSD[x]!=p8d[2+x])
								{
									break;
								}
							}
							if(x>=LEN_CSD)
							{
								break;
							}
						}
						p8d+=LENper_601E;
					}
		#endif
					if(i<NUMmax_601E)
					{//采集规则库中找到全匹配
						Len=Get_DL698DataLen(p8d+2,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
						Len>>=8;
						p8d+=2+Len+4;
						if(UARTCtrl->RM_DI_CHOICE!=0)//抄表DI选择:0=主DI,1=备用DI
						{//备用DI
							x=p8d[1];//数组数
							x*=6;
							x+=2;
							p8d+=x;
						}
						i=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
						x=p8d[1];
						UARTCtrl->RMCSDSubCountMax=x;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
						UARTCtrl->RMROADCountMax=0;//抄表CSD的ROAD内有OAD最大个数(非DL698抄表规约库设定)
						if(i>=x)
						{//抄表CSD子计数>=数组数
							return 0;//抄完
						}
						p8d+=4+(i*6);
						i=(p8d[0]<<24)|(p8d[1]<<16)|(p8d[2]<<8)|p8d[3];
						UARTCtrl->RM_DI=i;
						return (u8*)1;
					}
				//再找单个OAD匹配
					if(UARTCtrl->RMCSD[1]==0)//当前正在抄的CSD(有数据类型)
					{//不是ROAD错
						return 0;
					}
					i=UARTCtrl->RMROADCount;//抄表CSD的ROAD内OAD计数(非DL698抄表时)
					x=UARTCtrl->RMCSD[6];//ROAD个数
					UARTCtrl->RMROADCountMax=x;//抄表CSD的ROAD内有OAD最大个数(非DL698抄表规约库设定)
					if(i>=x)
					{//抄表ROAD计数>=数组数
						return 0;//抄完
					}
					OAD=(UARTCtrl->RMCSD[2]<<24)|(UARTCtrl->RMCSD[3]<<16)|(UARTCtrl->RMCSD[4]<<8)|UARTCtrl->RMCSD[5];
					i*=4;
					i+=7;
					ROAD=(UARTCtrl->RMCSD[i]<<24)|(UARTCtrl->RMCSD[i+1]<<16)|(UARTCtrl->RMCSD[i+2]<<8)|UARTCtrl->RMCSD[i+3];
		#if PARAMETER_601E==0//设置参数601E采集规则库使用:0=内部默认,1=可设置
					p32=(u32*)SETINIT_601E_List;
					n=Get_SETINIT_601E_List_NUM();//得到采集规则库初始设置库列表个数
					for(i=0;i<n;i++)
					{
						p8d=(u8*)p32[0];
						if(p8d[0]==DataType_structure)
						{
							if(p8d[3]==1)
							{//是ROAD
								Len=(p8d[4]<<24)|(p8d[5]<<16)|(p8d[6]<<8)|p8d[7];
								if(OAD==Len)
								{
									if(p8d[8]==1)
									{//是单个ROAD
										Len=(p8d[9]<<24)|(p8d[10]<<16)|(p8d[11]<<8)|p8d[12];
										if(ROAD==Len)
										{//找到
											break;
										}
									}
								}
							}
						}
						p32+=2;
					}
					if(i>=n)
					{
						i=NUMmax_601E;
					}
		#else
			#if LENmax_601E>LEN_128KDATABUFF
					#error
			#endif
					MR(ADDR_128KDATABUFF,ADDR_601E,LENmax_601E);
					p8d=(u8*)ADDR_128KDATABUFF;
					for(i=0;i<NUMmax_601E;i++)
					{
						if(p8d[0]==DataType_structure)
						{
							if(p8d[3]==1)
							{//是ROAD
								Len=(p8d[4]<<24)|(p8d[5]<<16)|(p8d[6]<<8)|p8d[7];
								if(OAD==Len)
								{
									if(p8d[8]==1)
									{//是单个ROAD
										Len=(p8d[9]<<24)|(p8d[10]<<16)|(p8d[11]<<8)|p8d[12];
										if(ROAD==Len)
										{//找到
											break;
										}
									}
								}
							}
						}
						p8d+=LENper_601E;
					}
		#endif
					if(i>=NUMmax_601E)
					{
						return 0;
					}
					Len=Get_DL698DataLen(p8d+2,0,0,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:b31-b8长度,b7-b0元素计数
					Len>>=8;
					p8d+=2+Len+4;
					if(UARTCtrl->RM_DI_CHOICE!=0)//抄表DI选择:0=主DI,1=备用DI
					{//备用DI
						x=p8d[1];//数组数
						x*=6;
						x+=2;
						p8d+=x;
					}
					i=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
					x=p8d[1];
					UARTCtrl->RMCSDSubCountMax=x;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
					if(i>=x)
					{//抄表CSD子计数>=数组数
						return 0;//抄完
					}
					p8d+=4+(i*6);
					i=(p8d[0]<<24)|(p8d[1]<<16)|(p8d[2]<<8)|p8d[3];
					UARTCtrl->RM_DI=i;
					return (u8*)1;
					
				case 3://DL/T698.45
				case ProtocolNO_ABB://ABB
/*
				//单相曲线抄读
					if(UARTCtrl->RMCSD[1]==1)
					{//ROAD
						OAD=UARTCtrl->RMCSD[2+0]<<24;
						OAD|=UARTCtrl->RMCSD[2+1]<<16;
						OAD|=UARTCtrl->RMCSD[2+2]<<8;
						OAD|=UARTCtrl->RMCSD[2+3];
						if(OAD==0x50020200)
						{//分钟冻结
							i=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
							if(i>=1)
							{
								return 0;
							}
							id=UARTCtrl->TaskID;
							id=(id>>8)&0xff;//任务号
							i=UARTCtrl->MeterCount[id];//取档案号
							p8d=(u8*)ADDR_6000_SDRAM+(i*LENper_6000);
							p8d=Get_Element(p8d,2,8,0);//计算元素地址,使用ADDR_128KDATABUFF
							if(p8d==0)
							{
								return 0;
							}
							i=p8d[1];//取接线方式
							if(i==1)//未知（0），单相（1），三相三线（2），三相四线（3）
							{//单相,抄实时数据
								i=UARTCtrl->RMROADCount;//抄表CSD的ROAD内OAD计数(非DL698抄表时)
								x=UARTCtrl->RMCSD[6];
								UARTCtrl->RMCSDSubCountMax=1;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
								UARTCtrl->RMROADCountMax=x;//抄表CSD的ROAD内有OAD最大个数(非DL698抄表规约库设定)
								if(i>=x)
								{//抄表CSD子计数>=数组数
									return 0;//抄完
								}
								OAD=(UARTCtrl->RMCSD[7+(4*i)+0]<<24)+(UARTCtrl->RMCSD[7+(4*i)+1]<<16)+(UARTCtrl->RMCSD[7+(4*i)+2]<<8)+(UARTCtrl->RMCSD[7+(4*i)+3]<<0);
								switch(OAD)
								{
									case 0x20210200://1 冻结时标
										return 0;
									case 0x00100201://2 正向有功总电能
										break;
									case 0x00200201://3 反向有功总电能  
										break;
									case 0x00300200://4 组合无功1电能
										break;
									case 0x00400200://5 组合无功2电能
										break;
									case 0x00500201://6 一象限无功总电能
										break;
									case 0x00600201://7 二象限无功总电能
										break;
									case 0x00700201://8 三象限无功总电能
										break;
									case 0x00800201://9 四象限无功总电能
										break;
									case 0x20170200://10 有功需量
										break;
									case 0x20180200://11 无功需量
										break;
									case 0x20000200://12 电压
										break;										
									case 0x20000201://13 A相电压
										break;
									case 0x20010200://14 电流
										break;										
									case 0x20010201://15 A相电流
										break;
									case 0x20010400://16 零线电流
										break;
									case 0x20040200://17 有功功率
									case 0x20040202://18 A相有功功率
										break;
									case 0x20050200://19 无功功率
									case 0x20050202://20 A相无功功率
										break;
									case 0x200A0200://21 功率因数
									case 0x200A0202://22 A相功率因数
										break;
									case 0x11100201://23 冻结周期内正向有功最大需量 
										return 0;
									default:
										return 0;
								}
								UARTCtrl->RM_DI=OAD;
								return (u8*)1;
							}
							else
							{//三相，抄曲线冻结数据
								
