gdgly/NUC97X_JS/STM32F4xx/DL698/RM_TASK_USERxxx.c
							}
						}
					}
*/
				//
					x=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
					if(x)
					{//子计数!=0
						return 0;
					}
					UARTCtrl->RMROADCountMax=0;//抄表CSD的ROAD内有OAD最大个数(非DL698抄表规约库设定)
					UARTCtrl->RMCSDSubCountMax=0;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
					return (u8*)1;
				case 4://CJ/T 188-2004
					return 0;
			}
		case 2://事件采集方案
			
		#if (USER/100)==17//江苏系
			if(Terminal_Router->MinuteCollect==1)
				return 0;
		#endif
			i*=LENper_6016;
			i+=ADDR_6016_SDRAM;
			p8s=Get_Element((u8 *)i,2,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8s==0)
			{
				return 0;
			}
			i=p8s[3];//采集类型
			switch(i)
			{
				case 0://0	array ROAD	周期采集事件数据
					p8s+=4;
					break;
				case 1://1	NULL	根据通知采集所有事件数据
					return 0;
				case 2://2	array ROAD	根据通知采集指定事件数据
					p8s+=4;
					break;
				case 3://3  NULL 根据通知存储生成的事件数据
					return 0;
				default:
					return 0;
			}
			i=UARTCtrl->RMCSDCount;//抄表CSD计数
			x=Get_DL698ByteTypeLenValue(p8s+1);//得到DL698字节类型长度单元的值
			UARTCtrl->RMCSDCountMax=x;//抄表CSD最大个数
			if(i>=x)
			{//抄表CSD计数>=数组数
				return 0;
			}
			p8s=Get_Element(p8s,i+1,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8s==0)
			{
				return 0;
			}
			LEN_CSD=Get_DL698DataLen_S(p8s,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
			if(((LEN_CSD+1)>sizeof(UARTCtrl->RMCSD))||(LEN_CSD<6))
			{
				return 0;
			}
			//MR((u32)&UARTCtrl->RMCSD,(u32)p8s,LEN_CSD);
			//ROAD转为普通方案的RCSD格式，
			if(LEN_CSD)
			{
				LEN_CSD--;
			}
			UARTCtrl->RMCSD[0]=DataType_CSD;
			UARTCtrl->RMCSD[1]=1;
			MR(((u32)&UARTCtrl->RMCSD)+2,(u32)p8s+1,LEN_CSD);
		#if CompareMeterEventCount==1//全事件采集抄表是否比较发生次数:0=不比较(全部抄表数据写入文件),1=比较(只有次数变化的事件写入文件)
			RM_MeterEventAutoInc0x20220200(PORTn);//电能表事件抄读列选择若无发生次数(事件记录序号)则自动加入
		#endif
			x=UARTCtrl->RMprotocol;//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
			switch(x)
			{
				case 1://DL/T645-1997
					return 0;
				case 2://DL/T645-2007
					OAD=(UARTCtrl->RMCSD[2]<<24)|(UARTCtrl->RMCSD[3]<<16)|(UARTCtrl->RMCSD[4]<<8)|UARTCtrl->RMCSD[5];
					i=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
					UARTCtrl->RMCSDSubCountMax=2;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
					if(i>=2)
					{//抄表CSD子计数>=2
						return 0;
					}
					OAD=Get_Event645_DI(OAD,i);//获取当前的抄645表的数据项，OAD=事件OAD，index=当前OAD对应的第几个数据表示，从0开始，返回0=没有要抄读的数据标识
					if(OAD==0)
					{
						return 0;
					}
					UARTCtrl->RM_DI=OAD;
					UARTCtrl->RM_DI_N=0;
					return (u8*)1;
				case 3://DL/T698.45
					x=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
					if(x)
					{//子计数!=0
						return 0;
					}
					UARTCtrl->RMROADCountMax=0;//抄表CSD的ROAD内有OAD最大个数(非DL698抄表规约库设定)
					UARTCtrl->RMCSDSubCountMax=0;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
					return (u8*)1;
				case 4://CJ/T 188-2004
					return 0;
				default://ABB,Landis等
					return 0;
			}
		case 3://透明方案
//属性2（透明方案）∷=structure//删除时structure的数据单元清为0(NULL)
//{
//	方案编号     unsigned，
//	方案内容集   array 方案内容，
//	方案内容∷=structure
//	{
//		通信地址        	TSA，
//		开始前脚本id   	long-unsigned，
//		完成后脚本id   	long-unsigned，
//		方案控制标志  	structure，
//		{
//			上报透明方案结果并等待后续报文  bool，
//			等待后续报文超时时间（秒）      long-unsigned，
//			结果比对标识    enum{不比对（0），比（1），比对上报（2）}，
//			结果比对参数    structure
//			{
//				特征字节      unsigned，
//				截取开始      long-unsigned，
//				截取长度      long-unsigned
//			}
//		}
//		方案报文集 	 	array 方案报文
//		方案报文∷=structure
//		{
//			报文序号  unsigned，
//			报文内容  octet-string
//		}
//	}
//	存储深度     long-unsigned
//}
			i*=LENper_6018;
			i+=ADDR_6018;
			MR(ADDR_DATABUFF,i,7);
			p8s=(u8*)ADDR_DATABUFF;
			if(p8s[0]!=DataType_structure)
			{
				return 0;
			}
			id>>=8;
			id&=0xff;
			x=Get_DL698ByteTypeLenValue(p8s+5);//得到DL698字节类型长度单元的值
			if(UARTCtrl->MeterCount[id]>=x)
			{
				return 0;
			}
			p8s=Get_Element((u8*)(i+4),UARTCtrl->MeterCount[id]+1,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8s==0)
			{
				return 0;
			}
			//方案报文集
			p8s=Get_Element(p8s,5,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8s==0)
			{
				return 0;
			}
			i=UARTCtrl->RMCSDCount;
			x=Get_DL698ByteTypeLenValue(p8s+1);//得到DL698字节类型长度单元的值
			UARTCtrl->RMCSDCountMax=x;//抄表CSD最大个数
			if(i>=x)
			{
				return 0;
			}
			p8s=Get_Element(p8s,UARTCtrl->RMCSDCount+1,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8s==0)
			{
				return 0;
			}
			return p8s+4;
		case 4://上报方案
		case 5://脚本方案
		default:
			return 0;
	}
}















